itsbhupendrasingh/nuttyfi32/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM

##############################################################
### NuttyFi32 Board Support Package - SME Dehradun         ###
##############################################################

nuttyfi32.name=NuttyFi32 Dev Module

nuttyfi32.upload.tool=esptool_py
nuttyfi32.upload.maximum_size=1310720
nuttyfi32.upload.maximum_data_size=327680
nuttyfi32.upload.wait_for_upload_port=true

nuttyfi32.serial.disableDTR=true
nuttyfi32.serial.disableRTS=true

nuttyfi32.build.mcu=esp32
nuttyfi32.build.core=nuttyfi32
nuttyfi32.build.variant=nuttyfi32
nuttyfi32.build.board=NUTTYFI32_DEV

nuttyfi32.build.f_cpu=240000000L
nuttyfi32.build.flash_size=4MB
nuttyfi32.build.flash_freq=40m
nuttyfi32.build.flash_mode=dio
nuttyfi32.build.boot=dio
nuttyfi32.build.partitions=default
nuttyfi32.build.defines=

nuttyfi32.menu.PSRAM.disabled=Disabled
nuttyfi32.menu.PSRAM.disabled.build.defines=
nuttyfi32.menu.PSRAM.disabled.build.extra_libs=
nuttyfi32.menu.PSRAM.enabled=Enabled
nuttyfi32.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue
nuttyfi32.menu.PSRAM.enabled.build.extra_libs=-lc-psram-workaround -lm-psram-workaround

nuttyfi32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
nuttyfi32.menu.PartitionScheme.default.build.partitions=default
nuttyfi32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
nuttyfi32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
nuttyfi32.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
nuttyfi32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
nuttyfi32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
nuttyfi32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
nuttyfi32.menu.PartitionScheme.minimal.build.partitions=minimal
nuttyfi32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
nuttyfi32.menu.PartitionScheme.no_ota.build.partitions=no_ota
nuttyfi32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
nuttyfi32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
nuttyfi32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
nuttyfi32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
nuttyfi32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
nuttyfi32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
nuttyfi32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
nuttyfi32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
nuttyfi32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
nuttyfi32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
nuttyfi32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
nuttyfi32.menu.PartitionScheme.huge_app.build.partitions=huge_app
nuttyfi32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
nuttyfi32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
nuttyfi32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
nuttyfi32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
nuttyfi32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
nuttyfi32.menu.PartitionScheme.fatflash.build.partitions=ffat
nuttyfi32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
nuttyfi32.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
nuttyfi32.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
nuttyfi32.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

nuttyfi32.menu.CPUFreq.240=240MHz (WiFi/BT)
nuttyfi32.menu.CPUFreq.240.build.f_cpu=240000000L
nuttyfi32.menu.CPUFreq.160=160MHz (WiFi/BT)
nuttyfi32.menu.CPUFreq.160.build.f_cpu=160000000L
nuttyfi32.menu.CPUFreq.80=80MHz (WiFi/BT)
nuttyfi32.menu.CPUFreq.80.build.f_cpu=80000000L
nuttyfi32.menu.CPUFreq.40=40MHz (40MHz XTAL)
nuttyfi32.menu.CPUFreq.40.build.f_cpu=40000000L
nuttyfi32.menu.CPUFreq.26=26MHz (26MHz XTAL)
nuttyfi32.menu.CPUFreq.26.build.f_cpu=26000000L
nuttyfi32.menu.CPUFreq.20=20MHz (40MHz XTAL)
nuttyfi32.menu.CPUFreq.20.build.f_cpu=20000000L
nuttyfi32.menu.CPUFreq.13=13MHz (26MHz XTAL)
nuttyfi32.menu.CPUFreq.13.build.f_cpu=13000000L
nuttyfi32.menu.CPUFreq.10=10MHz (40MHz XTAL)
nuttyfi32.menu.CPUFreq.10.build.f_cpu=10000000L

nuttyfi32.menu.FlashMode.qio=QIO
nuttyfi32.menu.FlashMode.qio.build.flash_mode=dio
nuttyfi32.menu.FlashMode.qio.build.boot=qio
nuttyfi32.menu.FlashMode.dio=DIO
nuttyfi32.menu.FlashMode.dio.build.flash_mode=dio
nuttyfi32.menu.FlashMode.dio.build.boot=dio
nuttyfi32.menu.FlashMode.qout=QOUT
nuttyfi32.menu.FlashMode.qout.build.flash_mode=dout
nuttyfi32.menu.FlashMode.qout.build.boot=qout
nuttyfi32.menu.FlashMode.dout=DOUT
nuttyfi32.menu.FlashMode.dout.build.flash_mode=dout
nuttyfi32.menu.FlashMode.dout.build.boot=dout

nuttyfi32.menu.FlashFreq.80=80MHz
nuttyfi32.menu.FlashFreq.80.build.flash_freq=80m
nuttyfi32.menu.FlashFreq.40=40MHz
nuttyfi32.menu.FlashFreq.40.build.flash_freq=40m

nuttyfi32.menu.FlashSize.4M=4MB (32Mb)
nuttyfi32.menu.FlashSize.4M.build.flash_size=4MB
nuttyfi32.menu.FlashSize.8M=8MB (64Mb)
nuttyfi32.menu.FlashSize.8M.build.flash_size=8MB
nuttyfi32.menu.FlashSize.8M.build.partitions=default_8MB
nuttyfi32.menu.FlashSize.2M=2MB (16Mb)
nuttyfi32.menu.FlashSize.2M.build.flash_size=2MB
nuttyfi32.menu.FlashSize.2M.build.partitions=minimal
nuttyfi32.menu.FlashSize.16M=16MB (128Mb)
nuttyfi32.menu.FlashSize.16M.build.flash_size=16MB

nuttyfi32.menu.UploadSpeed.921600=921600
nuttyfi32.menu.UploadSpeed.921600.upload.speed=921600
nuttyfi32.menu.UploadSpeed.115200=115200
nuttyfi32.menu.UploadSpeed.115200.upload.speed=115200
nuttyfi32.menu.UploadSpeed.256000.windows=256000
nuttyfi32.menu.UploadSpeed.256000.upload.speed=256000
nuttyfi32.menu.UploadSpeed.230400.windows.upload.speed=256000
nuttyfi32.menu.UploadSpeed.230400=230400
nuttyfi32.menu.UploadSpeed.230400.upload.speed=230400
nuttyfi32.menu.UploadSpeed.460800.linux=460800
nuttyfi32.menu.UploadSpeed.460800.macosx=460800
nuttyfi32.menu.UploadSpeed.460800.upload.speed=460800
nuttyfi32.menu.UploadSpeed.512000.windows=512000
nuttyfi32.menu.UploadSpeed.512000.upload.speed=512000

nuttyfi32.menu.DebugLevel.none=None
nuttyfi32.menu.DebugLevel.none.build.code_debug=0
nuttyfi32.menu.DebugLevel.error=Error
nuttyfi32.menu.DebugLevel.error.build.code_debug=1
nuttyfi32.menu.DebugLevel.warn=Warn
nuttyfi32.menu.DebugLevel.warn.build.code_debug=2
nuttyfi32.menu.DebugLevel.info=Info
nuttyfi32.menu.DebugLevel.info.build.code_debug=3
nuttyfi32.menu.DebugLevel.debug=Debug
nuttyfi32.menu.DebugLevel.debug.build.code_debug=4
nuttyfi32.menu.DebugLevel.verbose=Verbose
nuttyfi32.menu.DebugLevel.verbose.build.code_debug=5
